/* No comment provided by engineer. */
"%@ copied to clipboard" = "%@ copied to clipboard";

/* No comment provided by engineer. */
"%d Confirmations" = "%d Confirmations";

/* No comment provided by engineer. */
"Transferred" = "Transferred";

/* No comment provided by engineer. */
"Received" = "Received";

/* No comment provided by engineer. */
"Sent" = "Sent";

/* No comment provided by engineer. */
"%d Transactions" = "%d Transactions";

/* No comment provided by engineer. */
"Settings" = "Settings";

/* No comment provided by engineer. */
"Add to Address book?" = "Add to Address book?";

/* No comment provided by engineer. */
"An error occurred validating your PIN code with the remote server. You may be offline or Blockchain may be experiencing difficulties. Would you like retry validation or instead enter your password manually?" = "An error occurred validating your PIN code with the remote server. You may be offline or Blockchain may be experiencing difficulties. Would you like retry validation or instead enter your password manually?";

/* No comment provided by engineer. */
"An error was encountered loading your wallet. You may be offline or Blockchain is experiencing difficulties. Please close the application and try again later or re-pair your device." = "You may be offline or Blockchain might be experiencing difficulties. Please close the application and try again later or re-pair your device.";

/* No comment provided by engineer. */
"Archive" = "Archive";

/* No comment provided by engineer. */
"Archived" = "Archived";

/* No comment provided by engineer. */
"Automatically" = "Automatically";

/* No comment provided by engineer. */
"Before accessing your wallet, please choose a pin number to use to unlock your wallet. It's important you remember this pin as it cannot be reset or changed without first unlocking the app." = "Before accessing your wallet, please choose a pin number to use to unlock your wallet. It's important you remember this pin as it cannot be reset or changed without first unlocking the app.";

/* No comment provided by engineer. */
"Cancel" = "Cancel";

/* No comment provided by engineer. */
"Cannot save PIN Code while wallet is not initialized or password is null" = "Cannot save PIN Code while wallet is not initialized or password is null";

/* No comment provided by engineer. */
"Change PIN" = "Change PIN";

/* No comment provided by engineer. */
"Close App" = "Close App";

/* No comment provided by engineer. */
"Confirm Payment" = "Confirm Payment";

/* No comment provided by engineer. */
"Send from..." = "Send from...";

/* No comment provided by engineer. */
"Send to..." = "Send to...";

/* No comment provided by engineer. */
"Decrypted PIN Password length 0" = "Decrypted PIN Password length 0";

/* No comment provided by engineer. */
"Decrypting Private Key" = "Decrypting Private Key";

/* No comment provided by engineer. */
"Enter Password" = "Enter Password";

/* No comment provided by engineer. */
"Error" = "Error";

/* No comment provided by engineer. */
"Failed To Load Wallet" = "Failed To Load Wallet";

/* No comment provided by engineer. */
"No internet connection." = "No internet connection.";

/* No comment provided by engineer. */
"Connection timed out. Please check your internet connection." = "Connection timed out. Please check your internet connection.";

/* No comment provided by engineer. */
"Empty response from server." = "Empty response from server.";

/* No comment provided by engineer. */
"Invalid server response. Please check your internet connection." = "Invalid server response. Please check your internet connection.";

/* No comment provided by engineer. */
"Forget Wallet" = "Forget Wallet";

/* No comment provided by engineer. */
"How would you like to pair?" = "How would you like to pair?";

/* No comment provided by engineer. */
"Import Address" = "Import Address";

/* No comment provided by engineer. */
"Imported Private Key %@" = "Imported Private Key %@";

/* No comment provided by engineer. */
"Information" = "Information";

/* No comment provided by engineer. */
"Invalid email address." = "Invalid email address.";

/* No comment provided by engineer. */
"Invalid GUID" = "Invalid GUID";

/* No comment provided by engineer. */
"Invalid Identifier" = "Invalid Identifier";

/* No comment provided by engineer. */
"Invalid Send Value" = "Please enter an amount";

/* No comment provided by engineer. */
"Signing Inputs" = "Signing Inputs";

/* No comment provided by engineer. */
"Signing Input %d" = "Signing Input %d";

/* No comment provided by engineer. */
"Finished Signing Inputs" = "Finished Signing Inputs";

/* No comment provided by engineer. */
"Any address" = "Any address";

/* No comment provided by engineer. */
"Invalid Shared Key" = "Invalid Shared Key";

/* No comment provided by engineer. */
"Invalid Status Code Returned %@" = "Invalid Status Code Returned %@";

/* No comment provided by engineer. */
"Invalid to bitcoin address" = "Invalid bitcoin address";

/* No comment provided by engineer. */
"From and destination account have to be different" = "From and destination account have to be different";

/* No comment provided by engineer. */
"From and destination address have to be different" = "From and destination address have to be different";

/* No comment provided by engineer. */
"Loading External Page" = "Loading External Page";

/* No comment provided by engineer. */
"Logout" = "Logout";

/* No comment provided by engineer. */
"Do you really want to log out?" = "Do you really want to log out?";

/* No comment provided by engineer. */
"Please enter your PIN" = "Enter PIN";

/* No comment provided by engineer. */
"Please enter a new PIN" = "Please enter a new PIN";

/* No comment provided by engineer. */
"Confirm your PIN" = "Confirm your PIN";

/* No comment provided by engineer. */
"Incorrect PIN. Please retry." = "Incorrect PIN. Please retry.";

/* No comment provided by engineer. */
"News, Price & Charts" = "News, Price & Charts";

/* No comment provided by engineer. */
"Manually" = "Manually";

/* No comment provided by engineer. */
"No" = "No";

/* No comment provided by engineer. */
"Sending Transaction" = "Sending Transaction";

/* No comment provided by engineer. */
"%@ available" = "%@ available";

/* No comment provided by engineer. */
"No Label" = "No Label";

/* No comment provided by engineer. */
"No Password Entered" = "No Password Entered";

/* No comment provided by engineer. */
"OK" = "OK";

/* No comment provided by engineer. */
"Scan Pairing Code" = "Scan Pairing Code";

/* No comment provided by engineer. */
"Parsing Pairing Code" = "Parsing Pairing Code";

/* No comment provided by engineer. */
"Password must 10 characters or longer" = "Password must be 10 characters or longer";

/* No comment provided by engineer. */
"Passwords do not match" = "Passwords do not match";

/* No comment provided by engineer. */
"Payment Sent!" = "Payment Sent";

/* No comment provided by engineer. */
"PIN Encrypted String is nil" = "PIN Encrypted String is nil";

/* No comment provided by engineer. */
"PIN Response Object key or value length 0" = "PIN Response Object key or value length 0";

/* No comment provided by engineer. */
"PIN Response Object success length 0" = "PIN Response Object success length 0";

/* No comment provided by engineer. */
"PIN Saved Successfully" = "PIN Saved Successfully";

/* No comment provided by engineer. */
"PIN Validation cannot be completed. Please enter your wallet password manually." = "PIN Validation cannot be completed. Please enter your wallet password manually.";

/* No comment provided by engineer. */
"PIN Validation Error" = "PIN Validation Error";

/* No comment provided by engineer. */
"Please choose another PIN" = "Please choose another PIN";

/* No comment provided by engineer. */
"Please enter your 36 character wallet identifier correctly. It can be found in the welcome email on startup." = "Please enter your 36 character wallet identifier correctly. It can be found in the welcome email on startup.";

/* No comment provided by engineer. */
"Please provide an email address." = "Please provide an email address.";

/* No comment provided by engineer. */
"Retry Validation" = "Retry Validation";

/* No comment provided by engineer. */
"Scan Watch Only Address?" = "Scan Watch Only Address?";

/* No comment provided by engineer. */
"Second Password Incorrect" = "Second Password Incorrect";

/* No comment provided by engineer. */
"Server Returned Null Status Code" = "Server Returned Null Status Code";

/* No comment provided by engineer. */
"Success" = "Success";

/* No comment provided by engineer. */
"The private key you are attempting to import is encrypted. Please enter the password below." = "The private key you are attempting to import is encrypted. Please enter the password below.";

/* No comment provided by engineer. */
"This action requires the second password for your bitcoin wallet. Please enter it below and press continue." = "This action requires the second password for your bitcoin wallet. Please enter it below and press continue.";

/* No comment provided by engineer. */
"This will erase all wallet data on this device. Please confirm you have your wallet information saved elsewhere otherwise any bitcoins in this wallet will be inaccessible!!" = "This will erase all wallet data on this device. Please confirm you have your wallet information saved elsewhere otherwise any bitcoins in this wallet will be inaccessible.";

/* No comment provided by engineer. */
"Unarchive" = "Unarchive";

/* No comment provided by engineer. */
"Unconfirmed" = "Unconfirmed";

/* No comment provided by engineer. */
"Unsupported Private Key Format" = "Unsupported Private Key Format";

/* No comment provided by engineer. */
"User Declined" = "User Declined";

/* No comment provided by engineer. */
"Wallet address %@ has funds available to spend. However the private key needs to be scanned from a paper wallet or QR Code. Would you like to scan the private key now?" = "Wallet address %@ has funds available to spend. However the private key needs to be scanned from a paper wallet or QR Code. Would you like to scan the private key now?";

/* No comment provided by engineer. */
"Wallet Paired Successfully." = "Wallet Paired Successfully.";

/* No comment provided by engineer. */
"You must have two-factor authentication disabled to pair manually." = "You must have two-factor authentication disabled to pair manually.";

/* No comment provided by engineer. */
"Warning!!!" = "Warning";

/* No comment provided by engineer. */
"Would you like to add the bitcoin address %@ to your address book?" = "Would you like to add the bitcoin address %@ to your address book?";

/* No comment provided by engineer. */
"Yes" = "Yes";

/* No comment provided by engineer. */
"Send" = "Send";

/* No comment provided by engineer. */
"Receive" = "Receive";

/* No comment provided by engineer. */
"You must enter a destination address" = "You must enter a destination address";

/* No comment provided by engineer. */
"You must enter a label" = "You must enter a label";

/* No comment provided by engineer. */
"Label must contain letters and numbers only" = "Label must contain letters and numbers only";

/* No comment provided by engineer. */
"Label must have less than 18 characters" = "Label must have less than 18 characters";

/* No comment provided by engineer. */
"* Minimum 10 characters" = "* Minimum 10 characters";

/* No comment provided by engineer. */
"Your wallet was successfully created." = "Your wallet was successfully created.";

/* No comment provided by engineer. */
"Weak" = "Weak";

/* No comment provided by engineer. */
"Regular" = "Regular";

/* No comment provided by engineer. */
"Normal" = "Normal";

/* No comment provided by engineer. */
"Strong" = "Strong";

/* No comment provided by engineer. */
"Close" = "Close";

/* No comment provided by engineer. */
"Create Account" = "Create Account";

/* No comment provided by engineer. */
"Name your account" = "Name your account";

/* No comment provided by engineer. */
"Label" = "Label";

/* No comment provided by engineer. */
"Done" = "Done";

/* No comment provided by engineer. */
"Save" = "Save";

/* No comment provided by engineer. */
"Create Wallet" = "Create Wallet";

/* No comment provided by engineer. */
"Edit Account" = "Edit Account";

/* No comment provided by engineer. */
"My Accounts" = "My Accounts";

/* No comment provided by engineer. */
"Total Balance" = "Total Balance";

/* No comment provided by engineer. */
"Imported Addresses" = "Imported Addresses";

/* No comment provided by engineer. */
"Imported Addresses (Archived)" = "Imported Addresses (Archived)";

/* No comment provided by engineer. */
"Address book" = "Address book";

/* No comment provided by engineer. */
"Please add an email address" = "Please add an email address";

/* No comment provided by engineer. */
"Downloading Wallet" = "Downloading Wallet";

/* No comment provided by engineer. */
"Decrypting Wallet" = "Decrypting Wallet";

/* No comment provided by engineer. */
"Loading transactions" = "Loading transactions";

/* No comment provided by engineer. */
"Initializing Wallet" = "Initializing Wallet";

/* No comment provided by engineer. */
"Checking for Wallet updates" = "Checking for Wallet updates";

/* No comment provided by engineer. */
"Creating Account" = "Creating Account";

/* No comment provided by engineer. */
"Creating new Wallet" = "Creating new Wallet";

/* No comment provided by engineer. */
"Importing key" = "Importing key";

/* No comment provided by engineer. */
"Merchant Map" = "Merchant Map";

/* No comment provided by engineer. */
"Merchant" = "Merchant";

/* No comment provided by engineer. */
"Support" = "Support";

/* No comment provided by engineer. */
"Terms of Service" = "Terms of Service";

/* No comment provided by engineer. */
"Transaction" = "Transaction";

/* No comment provided by engineer. */
"Manual Pairing" = "Manual Pairing";

/* No comment provided by engineer. */
"Password Required" = "Password Required";

/* No comment provided by engineer. */
"Second Password Required" = "Second Password Required";

/* No comment provided by engineer. */
"Create New Wallet" = "Create New Wallet";

/* No comment provided by engineer. */
"Automatic Pairing" = "Pair Your Wallet";

/* No comment provided by engineer. */
"Request Amount" = "Request Amount";

/* No comment provided by engineer. */
"Label Address" = "Label Address";

/* No comment provided by engineer. */
"Scan Private Key" = "Scan Private Key";

/* No comment provided by engineer. */
"Log in to my wallet" = "Log in to my wallet";

/* No comment provided by engineer. */
"Share on Twitter" = "Share on Twitter";

/* No comment provided by engineer. */
"Share on Facebook" = "Share on Facebook";

/* No comment provided by engineer. */
"Share via E-mail" = "Share via E-mail";

/* No comment provided by engineer. */
"Share via SMS" = "Share via SMS";

/* No comment provided by engineer. */
"Copy Address" = "Copy Address";

/* No comment provided by engineer. */
"Archive Address" = "Archive Address";

/* No comment provided by engineer. */
"Unarchive Address" = "Unarchive Address";

/* No comment provided by engineer. */
"You must leave at least one active address" = "You must leave at least one active address";

/* No comment provided by engineer. */
"Upgrade Now" = "Upgrade Now";

/* No comment provided by engineer. */
"You are now running our most secure Bitcoin wallet" = "You are now running our most secure Bitcoin wallet";

/* No comment provided by engineer. */
"Easy one time wallet backup keeps you in control of your funds" = "Easy one time wallet\nbackup keeps you in control\nof your funds";

/* No comment provided by engineer. */
"Anything you need to store, spend and receive your bitcoin" = "Anything you need to\nstore, spend and receive\nyour bitcoin";

/* No comment provided by engineer. */
"Upgrade Wallet" = "Upgrade Wallet";

/* No comment provided by engineer. */
"Not now" = "Not now";

/* No comment provided by engineer. */
"Update" = "Update";

/* No comment provided by engineer. */
"Success!" = "Success!";

/* No comment provided by engineer. */
"or Continue" = "or Continue";

/* No comment provided by engineer. */
"Warning" = "Warning";

/* No comment provided by engineer. */
"Your device appears to be jailbroken. The security of your wallet may be compromised." = "Your device appears to be jailbroken. The security of your wallet may be compromised.";

/* No comment provided by engineer */
"Identifier" = "Identifier";

/* No comment provided by engineer */
"Verifying" = "Verifying";

/* No comment provided by engineer */
"Copied to clipboard" = "Copied to clipboard";

// Transaction cell:
"RECEIVED" = "RECEIVED";
"SENT" = "SENT";
"TRANSFERRED" = "TRANSFERRED";
"1 second ago" = "1 second ago";
"%lld seconds ago" = "%lld seconds ago";
"1 minute ago" = "1 minute ago";
"%lld minutes ago" = "%lld minutes ago";
"1 hour ago" = "1 hour ago";
"%lld hours ago" = "%lld hours ago";
"Yesterday" = "Yesterday";

// Backup screens:
"Backup" = "Backup Funds";
"Word %@ of %@" = "Word %@ of %@";
"You backed your wallet up %@ days ago" = "You backed your wallet up %@ days ago";
"You only need to backup your wallet once, but it is a good idea to occasionally verify that your backup is valid." = "You only need to backup your wallet once, but it is a good idea to occasionally verify that your backup is valid.";
"BACKUP FUNDS" = "BACKUP FUNDS";
"You backed up your funds successfully" = "You backed up your funds successfully";
"VERIFY BACKUP" = "VERIFY BACKUP";
"Please try again" = "Please try again";
"Continue" = "Continue";
"Next word" = "Next word";
"Write the words down on a sheet of paper in the exact order they appear on a sheet of paper, and store it somewhere safe\n" = "Write the words down on a sheet of paper in the exact order they appear on a sheet of paper, and store it somewhere safe\n";
"(e.g, with your passport)" = "(e.g., with your passport)";
"Backing up your funds is easy and ensures you will not lose access to your bitcoins, even if our service becomes unavailable." ="Backing up your funds is easy and ensures you will not lose access to your bitcoins, even if our service becomes unavailable.";
"You have not backed up your funds yet" = "You have not backed up your funds yet";
"Now you can restore your funds using the 12 word recovery phrase in case you lose your wallet's password" = "Now you can restore your funds using the 12 word recovery phrase in case you lose your wallet's password";
"first word" = "first word";
"second word" = "second word";
"third word" = "third word";
"fourth word" = "fourth word";
"fifth word" = "fifth word";
"sixth word" = "sixth word";
"seventh word" = "seventh word";
"eighth word" = "eighth word";
"ninth word" = "ninth word";
"tenth word" = "tenth word";
"eleventh word" = "eleventh word";
"twelfth word" = "twelfth word";

// First account name:
"My Bitcoin Wallet" = "My Bitcoin Wallet";

/* No comment provided by engineer. */
"Address is not valid" = "Address is not valid";

/* No comment provided by engineer. */
"Bitcoin payment request" = "Bitcoin payment request";

/* No comment provided by engineer. */
"Add Email" = "Add Email";

/* No comment provided by engineer. */
"Account Details" = "Account Details";

/* No comment provided by engineer. */
"Email" = "Email";

/* No comment provided by engineer. */
"Please verify your email" = "Please verify your email";

/* No comment provided by engineer. */
"Display" = "Display";

/* No comment provided by engineer. */
"Local Currency" = "Local Currency";

/* No comment provided by engineer. */
"Bitcoin Units" = "Bitcoin Units";

/* No comment provided by engineer. */
"SMS" = "SMS";

/* No comment provided by engineer. */
"Notifications" = "Notifications";

/* No comment provided by engineer. */
"Your verified email address is used to send login codes when suspicious or unusual activity is detected, to remind you of your wallet login ID, and to send bitcoin payment alerts when you receive funds. We will not use your email address for marketing purposes." = "Your verified email address is used to send login codes when suspicious or unusual activity is detected, to remind you of your wallet login ID, and to send bitcoin payment alerts when you receive funds. We will not use your email address for marketing purposes.";

/* No comment provided by engineer. */
"Enable notifications to receive an email whenever you receive bitcoins. Only labeled addresses in your accounts and imported addresses are eligible to trigger notifications." = "Enable notifications to receive an email whenever you receive bitcoins. Only labeled addresses in your accounts and imported addresses are eligible to trigger notifications.";

/* No comment provided by engineer. */
"About" = "About";

/* No comment provided by engineer. */
"Privacy Policy" = "Privacy Policy";

/* No comment provided by engineer. */
"Verify" = "Verify";

/* No comment provided by engineer. */
"Sent to %@" = "Sent to %@";

/* No comment provided by engineer. */
"Enter your verification code" = "Enter your verification code";

/* No comment provided by engineer. */
"Resend verification email" = "Resend verification email";

/* No comment provided by engineer. */
"Change Email" = "Change Email";

/* No comment provided by engineer. */
"Your email has been verified." = "Your email has been verified.";

/* No comment provided by engineer. */
"Error loading settings" = "Error loading settings";

/* No comment provided by engineer. */
"Please check your internet connection." = "Please check your internet connection.";

/* No comment provided by engineer. */
"Please add an email address" = "Please add an email address";

/* No comment provided by engineer. */
"Wallet Identifier" = "Wallet Identifier";

/* No comment provided by engineer. */
"Would you like to keep the wallet you last used?" = "Would you like to keep the wallet you last used?";

/* No comment provided by engineer. */
"Payment Received" = "Payment Received";

/* No comment provided by engineer. */
"We’ve detected a previous installation of Blockchain Wallet on your phone." = "We’ve detected a previous installation of Blockchain Wallet on your phone.";

/* No comment provided by engineer. */
"Please choose from the options below." = "Please choose from the options below.";

/* No comment provided by engineer. */
"Enter Verification Code" = "Enter Verification Code";

/* No comment provided by engineer. */
"Fees" = "Fees";

/* No comment provided by engineer. */
"Fee per kilobyte" = "Fee per kilobyte";

/* No comment provided by engineer. */
"Change fee per kilobyte" = "Change fee per kilobyte";

/* No comment provided by engineer. */
"Current rate: %@ BTC" = "Current rate: %@ BTC";

/* No comment provided by engineer. */
"%@ BTC" = "%@ BTC";

/* No comment provided by engineer. */
"Fee is too high (0.01 BTC limit)" = "Fee is too high (0.01 BTC limit)";

/* No comment provided by engineer. */
"Updating settings" = "Updating settings";

/* No comment provided by engineer. */
"Authorization Required" = "Authorization Required";

/* No comment provided by engineer. */
"Please check your email." = "Please check your email.";

/* No comment provided by engineer. */
"Use all %@" = "Use all %@";

/* No comment provided by engineer. */
"Insufficient Funds" = "Insufficient Funds";

/* No comment provided by engineer. */
"Please select a different address to send from or lower the fee in Settings." = "Please select a different address to send from or lower the fee in Settings.";

/* No comment provided by engineer. */
"Just now" = "Just now";

/* No comment provided by engineer. */
"Use all funds" = "Use all funds";

/* No comment provided by engineer. */
"The amount you want to send (%@) is greater than the maximum amount you can spend minus the fee (%@ - %@). Would you like to send %@?" = "The amount you want to send (%@) is greater than the maximum amount you can spend minus the fee (%@ - %@). Would you like to send %@?";

/* No comment provided by engineer. */
"New Address" = "New Address";

/* No comment provided by engineer. */
"Scan QR code" = "Scan QR code";

/* No comment provided by engineer. */
"Updating label" = "Updating label";

/* No comment provided by engineer. */
"Enable Location Services" = "Enable Location Services";

/* No comment provided by engineer. */
"Blockchain needs Location Services enabled in order to access your location." ="Blockchain needs Location Services enabled in order to access your location.";

/* No comment provided by engineer. */
"Blockchain needs Location Services enabled in order to access your location. You can enable access in Settings->Privacy->Location Services" = "Blockchain needs Location Services enabled in order to access your location. You can enable access in Settings->Privacy->Location Services";

/* No comment provided by engineer. */
"Blockchain needs Location Services enabled in order to access your location. You can enable access in Settings->Privacy->Location->Location Services" = "Blockchain needs Location Services enabled in order to access your location. You can enable access in Settings->Privacy->Location->Location Services";

/* No comment provided by engineer. */
"Go to Settings" = "Go to Settings";

/* No comment provided by engineer. */
"You have no available funds to send from this address" = "You have no available funds to send from this address";

/* No comment provided by engineer. */
"Amount must be above dust threshold (%lld Satoshi)" = "Amount must be above dust threshold (%lld Satoshi)";

/* No comment provided by engineer. */
"An error was encountered retrieving your wallet identifier from the keychain. Please close the application and try again." = "An error was encountered retrieving your wallet identifier from the keychain. Please close the application and try again.";

/* No comment provided by engineer. */
"Wallet version %lld not supported" = "Wallet version %lld not supported";

/* No comment provided by engineer. */
"Syncing wallet" = "Syncing wallet";

/* No comment provided by engineer. */
"Error updating settings" = "Error updating settings";

/* No comment provided by engineer. */
"Invalid Pairing Code" = "Invalid Pairing Code";

/* No comment provided by engineer. */
"Copy to clipboard" = "Copy to clipboard";

/* No comment provided by engineer. */
"Warning: Your wallet identifier is sensitive information. Copying it may compromise the security of your wallet." = "Warning: Your wallet identifier is sensitive information. Copying it may compromise the security of your wallet.";

/* No comment provided by engineer. */
"Copy GUID" = "Copy GUID";

/* No comment provided by engineer. */
"Recover Wallet" = "Recover Wallet";

/* No comment provided by engineer. */
"Recovering wallet" = "Recovering wallet";

/* No comment provided by engineer. */
"Please enter your recovery phrase with words separated by spaces" = "Please enter your recovery phrase with words separated by spaces";

/* No comment provided by engineer. */
"Adjust Fee" = "Adjust Fee";

/* No comment provided by engineer. */
"Invalid recovery phrase. Please try again" = "Invalid recovery phrase. Please try again";

/* No comment provided by engineer. */
"Merchant Directory is currently unavailable. Please try again later." = "Merchant Directory is currently unavailable. Please try again later.";

/* No comment provided by engineer. */
"Invalid verification code. Please try again." = "Invalid verification code. Please try again.";

/* No comment provided by engineer. */
"No internet connection available. Please check your network settings." = "No internet connection available. Please check your network settings.";

/* No comment provided by engineer. */
"You do not have an account set up for Mail. Please contact %@" = "You do not have an account set up for Mail. Please contact %@";

/* No comment provided by engineer. */
"Blockchain is currently down for maintenance. Please try again later." = "Blockchain is currently down for maintenance. Please try again later.";

/* No comment provided by engineer. */
"Warning" = "Warning";

/* No comment provided by engineer. */
"The PIN you have selected is extremely common and may be easily guessed by someone with access to your phone within 3 tries. Would you like to use this PIN anyway?" = "The PIN you have selected is extremely common and may be easily guessed by someone with access to your phone within 3 tries. Would you like to use this PIN anyway?";

/* No comment provided by engineer. */
"Try again" = "Try again";

/* No comment provided by engineer. */
"Checking for more accounts: Step %d of %d" = "Checking for more accounts: Step %d of %d";

/* No comment provided by engineer. */
"Found account %d, with %@" = "Found account %d, with %@";

/* No comment provided by engineer. */
"Creating Wallet" = "Creating Wallet";

/* No comment provided by engineer. */
"Recovering Funds" = "Recovering Funds";

/* No comment provided by engineer. */
"Syncing Wallet" = "Syncing Wallet";

/* No comment provided by engineer. */
"Recover Funds" = "Recover Funds";

/* No comment provided by engineer. */
"Log in to my Wallet" = "Log in to my Wallet";

/* No comment provided by engineer. */
"Login existing Wallet" = "Login existing Wallet";

/* No comment provided by engineer. */
"Please enter your recovery phrase with words separated by spaces" = "Please enter your recovery phrase with words separated by spaces";

/* No comment provided by engineer. */
"Camera Access Denied" = "Camera Access Denied";

/* No comment provided by engineer. */
"Blockchain does not have access to the camera. To enable access, go to your device Settings." = "Blockchain does not have access to the camera. To enable access, go to your device Settings.";

/* No comment provided by engineer. */
"There was a problem verifying your identity." = "There was a problem verifying your identity.";

/* No comment provided by engineer. */
"Your identity does not match our records." = "Your identity does not match our records.";

/* No comment provided by engineer. */
"Touch ID is not available on this device." = "Touch ID is not available on this device.";

/* No comment provided by engineer. */
"Authenticate with Touch ID" = "Authenticate with Touch ID";

/* No comment provided by engineer. */
"Security" = "Security";

/* No comment provided by engineer. */
"Use Touch ID as PIN" = "Use Touch ID as PIN";

/* No comment provided by engineer. */
"Enter PIN" = "Enter PIN";

/* No comment provided by engineer. */
"Upgrade to V3" = "Upgrade to V3";

/* No comment provided by engineer. */
"Creating V3 Wallet" = "Creating V3 Wallet";

/* No comment provided by engineer. */
"You should always pair or login if you have access to your GUID and password. Recovering your funds will create a new GUID. Would you like to continue?" = "You should always pair or login if you have access to your GUID and password. Recovering your funds will create a new GUID. Would you like to continue?";

/* No comment provided by engineer. */
"Transactions with no fees may take a long time to confirm or may not be confirmed at all. Would you like to continue?" = "Transactions with no fees may take a long time to confirm or may not be confirmed at all. Would you like to continue?";

/* No comment provided by engineer. */
"Invalid address: %@" = "Invalid address: %@";

/* No comment provided by engineer. */
"Enabling this feature will allow all users with a registered Touch ID fingerprint on this device to access to your wallet." = "Enabling this feature will allow all users with a registered Touch ID fingerprint on this device to access to your wallet.";

/* No comment provided by engineer. */
"Touch ID is not enabled on this device. To enable Touch ID, go to Settings->Touch ID & Passcode and add a fingerprint." = "Touch ID is not enabled on this device. To enable Touch ID, go to Settings->Touch ID & Passcode and add a fingerprint.";

/* No comment provided by engineer. */
"Please enter a fee greater than 0 BTC and at most 0.01 BTC" = "Please enter a fee greater than 0 BTC and at most 0.01 BTC";

/* No comment provided by engineer. */
"Wallet ID" = "Wallet ID";

/* No comment provided by engineer. */
"Fee per KB" = "Fee per KB";

/* No comment provided by engineer. */
"Bitcoin Unit" = "Bitcoin Unit";

/* No comment provided by engineer. */
"Unable to load wallet due to no server response. You may be offline or Blockchain is experiencing difficulties. Please try again later." = "Unable to load wallet due to no server response. You may be offline or Blockchain is experiencing difficulties. Please try again later.";

/* No comment provided by engineer. */
"Change Password Hint" = "Change Password Hint";

/* No comment provided by engineer. */
"Password Hint" = "Password Hint";

/* No comment provided by engineer. */
"Change Password" = "Change Password";

/* No comment provided by engineer. */
"Mobile Number" = "Mobile Number";

/* No comment provided by engineer. */
"Change Mobile Number" = "Change Mobile Number";

/* No comment provided by engineer. */
"2-step Verification" = "2-step Verification";

/* No comment provided by engineer. */
"Unverified" = "Unverified";

/* No comment provided by engineer. */
"Verified" = "Verified";

/* No comment provided by engineer. */
"New Mobile Number" = "New Mobile Number";

/* No comment provided by engineer. */
"New Email Address" = "New Email Address";

/* No comment provided by engineer. */
"Your mobile number has been verified." = "Your mobile number has been verified.";

/* No comment provided by engineer. */
"Stored" = "Stored";

/* No comment provided by engineer. */
"Not Stored" = "Not Stored";

/* No comment provided by engineer. */
"Update" = "Update";

/* No comment provided by engineer. */
"Invalid mobile number." = "Invalid mobile number.";

/* No comment provided by engineer. */
"Your password hint has been updated." = "Your password hint has been updated.";

/* No comment provided by engineer. */
"An error occurred while updating your password hint." = "An error occurred while updating your password hint.";

/* No comment provided by engineer. */
"Your new password hint contains no text. Your password hint will be cleared." = "Your new password hint contains no text. Your password hint will be cleared.";

/* No comment provided by engineer. */
"Incorrect password" = "Incorrect password";

/* No comment provided by engineer. */
"Password changed. Please login to continue." = "Password changed. Please login to continue.";

/* No comment provided by engineer. */
"Google Authenticator" = "Google Authenticator";

/* No comment provided by engineer. */
"Disabled" = "Disabled";

/* No comment provided by engineer. */
"You can enable 2-step Verification via SMS on your mobile phone. In order to use other authentication methods instead, please login to our web wallet." = "You can enable 2-step Verification via SMS on your mobile phone. In order to use other authentication methods instead, please login to our web wallet.";

/* No comment provided by engineer. */
"2-step Verification is currently enabled for %@." = "2-step Verification is currently enabled for %@.";

/* No comment provided by engineer. */
"2-step Verification is currently disabled." = "2-step Verification is currently disabled.";

/* No comment provided by engineer. */
"Enable" = "Enable";

/* No comment provided by engineer. */
"Disable" = "Disable";

/* No comment provided by engineer. */
"Resend verification SMS" = "Resend verification SMS";

/* No comment provided by engineer. */
"Send verification SMS" = "Send verification SMS";

/* No comment provided by engineer. */
"Please enter your %@ 2FA code" = "Please enter your %@ 2FA code";

/* No comment provided by engineer. */
"Your new password hint contains invalid characters. Please try again." = "Your new password hint contains invalid characters. Please try again.";

/* No comment provided by engineer. */
"Your new password hint must be different from your password. Please try again." = "Your new password hint must be different from your password. Please try again.";

/* No comment provided by engineer. */
"Your new password hint must be different from your second password. Please try again." = "Your new password hint must be different from your second password. Please try again.";

/* No comment provided by engineer. */
"Invalid two-factor authentication type" = "Invalid two-factor authentication type";

/* No comment provided by engineer. */
"New password must be different" = "New password must be different";

/* No comment provided by engineer. */
"2-step Verification is currently enabled." = "2-step Verification is currently enabled.";

/* No comment provided by engineer. */
"Notifications" = "Notifications";

/* No comment provided by engineer. */
"Wallet Information" = "Wallet Information";

/* No comment provided by engineer. */
"Preferences" = "Preferences";

/* No comment provided by engineer. */
"Accounts" = "Accounts";

/* No comment provided by engineer. */
"Please verify your email address first." = "Please verify your email address first.";

/* No comment provided by engineer. */
"Invalid Wallet ID" = "Invalid Wallet ID";

/* No comment provided by engineer. */
"You should always pair or login if you have access to your Wallet ID and password. Recovering your funds will create a new Wallet ID. Would you like to continue?" = "You should always pair or login if you have access to your Wallet ID and password. Recovering your funds will create a new Wallet ID. Would you like to continue?";

/* No comment provided by engineer. */
"Copy Wallet ID" = "Copy Wallet ID";

/* No comment provided by engineer. */
"Write the words down in the exact order they appear on a sheet of paper, and store it somewhere safe\n" = "Write the words down in the exact order they appear on a sheet of paper, and store it somewhere safe\n";

/* No comment provided by engineer. */
"Please check your email. If you have already verified a login attempt, you should log in via our web wallet and pair your phone by scanning the QR code under Settings -> Wallet Information." = "Please check your email. If you have already verified a login attempt, you should log in via our web wallet and pair your phone by scanning the QR code under Settings -> Wallet Information.";

/* No comment provided by engineer. */
"Confirm Upgrade" = "Confirm Upgrade";

/* No comment provided by engineer. */
"Upgrade" = "Upgrade";

/* No comment provided by engineer. */
"Upgrade Now" = "Upgrade Now";

/* No comment provided by engineer. */
"Email Notifications" = "Email Notifications";

/* No comment provided by engineer. */
"Enable notifications to receive an email whenever you receive bitcoins. Only labeled addresses and imported addresses are eligible to trigger notifications." = "Enable notifications to receive an email whenever you receive bitcoins. Only labeled addresses and imported addresses are eligible to trigger notifications.";

/* No comment provided by engineer. */
"Checking for more: Step %d of %d" = "Checking for more: Step %d of %d";

/* No comment provided by engineer. */
"Found %d, with %@" = "Found %d, with %@";

/* No comment provided by engineer. */
"From and destination have to be different" = "From and destination have to be different";

/* No comment provided by engineer. */
"Create" = "Create";

/* No comment provided by engineer. */
"Name" = "Name";

/* No comment provided by engineer. */
"Edit" = "Edit";

/* No comment provided by engineer. */
"Creating" = "Creating";

/* No comment provided by engineer. */
"Customize the way you organize your bitcoins in your Blockchain Wallet" =  "Customize the way you organize your bitcoins in your Blockchain Wallet";

/* No comment provided by engineer. */
"Checking for more: Step %d of %d" = "Checking for more: Step %d of %d";

/* No comment provided by engineer. */
"Found %d, with %@" = "Found %d, with %@";

/* No comment provided by engineer. */
"Security Center" = "Security Center";

/* No comment provided by engineer. */
"Complete the steps below for ultimate security" = "Complete the steps below for ultimate security";

/* No comment provided by engineer. */
"Verify Email" = "Verify Email";

/* No comment provided by engineer. */
"Email Verified" = "Email Verified";

/* No comment provided by engineer. */
"Backup Phrase" = "Backup Phrase";

/* No comment provided by engineer. */
"Phrase Backed" = "Phrase Backed";

/* No comment provided by engineer. */
"Link Mobile" = "Link Mobile";

/* No comment provided by engineer. */
"Mobile Linked" = "Mobile Linked";

/* No comment provided by engineer. */
"Store Hint" = "Store Hint";

/* No comment provided by engineer. */
"Hint Stored" = "Hint Stored";

/* No comment provided by engineer. */
"2-Step Enabled" = "2-Step Enabled";

/* No comment provided by engineer. */
"Enable 2-Step" = "Enable 2-Step";

/* No comment provided by engineer. */
"We'll send the hint to your confirmed email address in case you request it." = "We'll send the hint to your confirmed email address in case you request it.";

/* No comment provided by engineer. */
"Enable 2-Step for SMS" = "Enable 2-Step for SMS";

/* No comment provided by engineer. */
"Tor Requests" = "Tor Requests";

/* No comment provided by engineer. */
"Tor requests are currently blocked." = "Tor requests are currently blocked.";

/* No comment provided by engineer. */
"Tor requests are currently allowed." = "Tor requests are currently allowed.";

/* No comment provided by engineer. */
"Enable this option to prevent IP addresses that are known to be part of the Tor anonymizing network from accessing your wallet. The Tor network is frequently used by hackers attempting to access Blockchain users' wallets." = "Enable this option to prevent IP addresses that are known to be part of the Tor anonymizing network from accessing your wallet. The Tor network is frequently used by hackers attempting to access Blockchain users' wallets.";

/* No comment provided by engineer. */
"Block" = "Block";

/* No comment provided by engineer. */
"Allow" = "Allow";

/* No comment provided by engineer. */
"Blocked" = "Blocked";

/* No comment provided by engineer. */
"Allowed" = "Allowed";

/* No comment provided by engineer. */
"Tor blocked" = "Tor blocked";

/* No comment provided by engineer. */
"Block Tor" = "Block Tor";

/* No comment provided by engineer. */
"Tor requests allowed" = "Tor requests allowed";

/* No comment provided by engineer. */
"Wallet Recovery Phrase" = "Wallet Recovery Phrase";

/* No comment provided by engineer. */
"Unconfirmed" = "Unconfirmed";

/* No comment provided by engineer. */
"Debug" = "Debug";

/* No comment provided by engineer. */
"Server URL" = "Server URL";

/* No comment provided by engineer. */
"WebSocket URL" = "WebSocket URL";

/* No comment provided by engineer. */
"Merchant URL" = "Merchant URL";

/* No comment provided by engineer. */
"Wallet JSON" = "Wallet JSON";

/* No comment provided by engineer. */
"Please Login" = "Please Login";

/* No comment provided by engineer. */
"Reset" = "Reset";

/* No comment provided by engineer. */
"from" = "from";

/* No comment provided by engineer. */
"Welcome" = "Welcome";

/* No comment provided by engineer. */
"Write down your Recovery Phrase and keep it somewhere very safe and secure. Remember that anyone who knows your Recovery Phrase has access to your bitcoins." = "Write down your Recovery Phrase and keep it somewhere very safe and secure. Remember that anyone who knows your Recovery Phrase has access to your bitcoins.";

/* No comment provided by engineer. */
"Everything you need to store, spend and receive your bitcoin" = "Everything you need to\nstore, spend and receive\nyour bitcoin";

/* No comment provided by engineer. */
"PIN" = "PIN";

/* No comment provided by engineer. */
"Import Private Key" = "Import Private Key";

/* No comment provided by engineer. */
"You must disable SMS 2-Step Verification before changing your mobile number (%@)." = "You must disable SMS 2-Step Verification before changing your mobile number (%@).";

/* No comment provided by engineer. */
"Archived" = "Archived";

/* No comment provided by engineer. */
"Address" = "Address";

/* No comment provided by engineer. */
"Extended Public Key" = "Extended Public Key";

/* No comment provided by engineer. */
"Make Default" = "Make Default";

/* No comment provided by engineer. */
"This thing is archived. That means it cannot be accessed in the app, and you cannot send funds from it.\n\nIf there are any funds, they will be safe. In order to start using this thing again, unarchive it." = "This thing is archived. That means it cannot be accessed in the app, and you cannot send funds from it.\n\nIf there are any funds, they will be safe. In order to start using this thing again, unarchive it.";

/* No comment provided by engineer. */
"Show your xPub if you are a merchant and use the Blockchain Merchant app to receive funds safely and privately.\n\nKeep your xPub private. Someone with access to your xPub will be able to see all of your funds and transactions." = "Show your xPub if you are a merchant and use the Blockchain Merchant app to receive funds safely and privately.\n\nKeep your xPub private. Someone with access to your xPub will be able to see all of your funds and transactions.";

/* No comment provided by engineer. */
"Archive this if you do NOT want to use it anymore. Your funds will remain safe, and you can unarchive it at any time." = "Archive this if you do NOT want to use it anymore. Your funds will remain safe, and you can unarchive it at any time.";

/* No comment provided by engineer. */
"This is a watch-only address. To spend your funds from this wallet, please scan your private key." = "This is a watch-only address. To spend your funds from this wallet, please scan your private key.";

/* No comment provided by engineer. */
"Set as Default?" = "Set as Default?";

/* No comment provided by engineer. */
"Watch Only" = "Watch Only";

/* No comment provided by engineer. */
"Sharing your xPub authorizes others to track your transaction history. As authorized persons may be able to disrupt you from accessing your wallet, only share your xPub with people you trust." = "Sharing your xPub authorizes others to track your transaction history. As authorized persons may be able to disrupt you from accessing your wallet, only share your xPub with people you trust.";

/* No comment provided by engineer. */
"Scan this code or copy it into your Blockchain Merchant app to securely receive Bitcoin." = "Scan this code or copy it into your Blockchain Merchant app to securely receive Bitcoin.";

/* No comment provided by engineer. */
"Copy xPub" = "Copy xPub";

/* No comment provided by engineer. */
"Default" = "Default";

/* No comment provided by engineer. */
"You've successfully imported a private key. Note that it does not correspond to this watch-only address. If you want to spend from this address, make sure that you scan the correct private key." = "You've successfully imported a private key. Note that it does not correspond to this watch-only address. If you want to spend from this address, make sure that you scan the correct private key.";

/* No comment provided by engineer. */
"Your wallet does not contain this address." = "Your wallet does not contain this address.";

/* No comment provided by engineer. */
"This address is not watch-only." = "This address is not watch-only.";

/* No comment provided by engineer. */
"This private key does not correspond to this watch-only address. If you want to spend from this address, make sure you scan the correct private key." = "This private key does not correspond to this watch-only address. If you want to spend from this address, make sure you scan the correct private key.";

/* No comment provided by engineer. */
"Wrong BIP38 Password" = "Wrong BIP38 Password";

/* No comment provided by engineer. */
"This private key belongs to another address that is not watch only" = "This private key belongs to another address that is not watch only";

/* No comment provided by engineer. */
"You can now spend from this address." = "You can now spend from this address.";

/* No comment provided by engineer. */
"You've successfully imported the private key for ​the address %@, and you can now spend from it. If you want to spend from this address, make sure you scan the correct private key." = "You've successfully imported the private key for ​the address %@, and you can now spend from it. If you want to spend from this address, make sure you scan the correct private key.";

/* No comment provided by engineer. */
"API URL" = "API URL";

/* No comment provided by engineer. */
"If you are a merchant, show your xPub and use the Blockchain Merchant app to receive funds safely and privately." = "If you are a merchant, show your xPub and use the Blockchain Merchant app to receive funds safely and privately.";

/* No comment provided by engineer. */
"Keep your xPub private. Someone with access to your xPub will be able to see all of your funds and transactions." = "Keep your xPub private. Someone with access to your xPub will be able to see all of your funds and transactions.";

/* No comment provided by engineer. */
"You are about to import a watch-only address, an address (or public key script) stored in the wallet without the corresponding private key. You cannot spend bitcoin from a watch-only address directly, but you can get the balance, or export a transaction to be signed externally. This means that the funds can be spent ONLY if you have the private key stored elsewhere. If you do not have the private key stored, do NOT instruct anyone to send you bitcoin to the watch-only address." = "You are about to import a watch-only address, an address (or public key script) stored in the wallet without the corresponding private key. You cannot spend bitcoin from a watch-only address directly, but you can get the balance, or export a transaction to be signed externally. This means that the funds can be spent ONLY if you have the private key stored elsewhere. If you do not have the private key stored, do NOT instruct anyone to send you bitcoin to the watch-only address.";

/* No comment provided by engineer. */
"Unknown key format" = "Unknown key format";

/* No comment provided by engineer. */
"Create new address" = "Create new address";

/* No comment provided by engineer. */
"Import address" = "Import address";

/* No comment provided by engineer. */
"Creating new address" = "Creating new address";

/* No comment provided by engineer. */
"Imported watch-only address %@" = "Imported watch-only address %@";

/* No comment provided by engineer. */
"These options are recommended for advanced users only. Continue?" = "These options are recommended for advanced users only. Continue?";

/* No comment provided by engineer. */
"This name is already in use. Please choose a different name." = "This name is already in use. Please choose a different name.";

/* No comment provided by engineer. */
"Verification email has been sent to %@." = "Verification email has been sent to %@.";

/* No comment provided by engineer. */
"Please refresh the pairing code and try again." = "Please refresh the pairing code and try again.";

/* No comment provided by engineer. */
"You are about to receive bitcoin to a watch-only address. You can only spend these funds if you have access to the private key. Continue?" = "You are about to receive bitcoin to a watch-only address. You can only spend these funds if you have access to the private key. Continue?";

/* No comment provided by engineer. */
"Don't show again" = "Don't show again";

/* No comment provided by engineer. */
"New password must be different from your password hint" = "New password must be different from your password hint";

/* No comment provided by engineer. */
"Processing key" = "Processing key";

/* No comment provided by engineer. */
"You've successfully imported a private key." = "You've successfully imported a private key.";

/* No comment provided by engineer. */
"NOTE: The scanned private key does not correspond to this watch-only address. If you want to spend from this address, make sure that you scan the correct private key." = "NOTE: The scanned private key does not correspond to this watch-only address. If you want to spend from this address, make sure that you scan the correct private key.";

/* No comment provided by engineer. */
"This action requires the private key for the Bitcoin address %@. Please scan the QR code." = "This action requires the private key for the Bitcoin address %@. Please scan the QR code.";

/* No comment provided by engineer. */
"Private Key Needed" = "Private Key Needed";

/* No comment provided by engineer. */
"Incorrect private key" = "Incorrect private key";

/* No comment provided by engineer. */
"You must have at least one active address" = "You must have at least one active address";

/* No comment provided by engineer. */
"Transfer Funds" = "Transfer Funds";

/* No comment provided by engineer. */
"For your safety, we recommend you to transfer any balances in your imported addresses into your Blockchain wallet." = "For your safety, we recommend you to transfer any balances in your imported addresses into your Blockchain wallet.";

/* No comment provided by engineer. */
"Your transferred funds will be safe and secure, and you'll benefit from increased privacy and convenient backup and recovery features." = "Your transferred funds will be safe and secure, and you'll benefit from increased privacy and convenient backup and recovery features.";

/* No comment provided by engineer. */
"For your safety, we recommend you to transfer any balances in your imported addresses into your Blockchain wallet." = "For your safety, we recommend you to transfer any balances in your imported addresses into your Blockchain wallet.";